# =============================================================================
# MODEL: HematiteV10 (Skinny Head Edition)
# TARGET: ~1.2M Parameters (Matches your 1.37M Goal)
# STRATEGY: Backbone stays strong (128), Head reduced to 64 channels.
# =============================================================================

depth_multiple: 0.33
width_multiple: 1.00
nc: 80

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [16, 3, 2]]  # P1/2 
  - [-1, 1, Conv, [32, 3, 2]]  # P2/4
  - [-1, 3, C2f, [32, True]]   
  - [-1, 1, CBAM, [32]]       

  - [-1, 1, Conv, [64, 3, 2]]  # P3/8
  - [-1, 6, C2f, [64, True]]   
  - [-1, 1, CBAM, [64]]      

  - [-1, 1, Conv, [128, 3, 2]] # P4/16
  - [-1, 6, C2f, [128, True]]  
  - [-1, 1, CBAM, [128]]      

  # Backbone ends at 128 channels (Strong features)
  - [-1, 1, Conv, [128, 3, 2]] # P5/32
  - [-1, 3, C2f, [128, True]]  
  - [-1, 1, SPPF, [128, 5]]    

head:
  # === SKINNY NECK (All reduced to 64) ===
  # Reducing these from 128 -> 64 cuts parameters by ~40%
  
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 9], 1, Concat, [1]]  
  - [-1, 3, C2f, [64]]         # Layer 15 (Was 128)

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 6], 1, Concat, [1]]  
  - [-1, 3, C2f, [64]]         # Layer 18 (Stayed 64)

  - [-1, 1, Conv, [64, 3, 2]]
  - [[-1, 15], 1, Concat, [1]] 
  - [-1, 3, C2f, [64]]         # Layer 21 (Was 128)

  - [-1, 1, Conv, [64, 3, 2]]
  - [[-1, 12], 1, Concat, [1]] 
  - [-1, 3, C2f, [64]]         # Layer 24 (Was 256/128)

  # Detects using only 64 channels per scale
  - [[18, 21, 24], 1, Detect, [nc]]